Reports/ИА_ФинансоваяДирективаЛист3.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ИА_ФинансоваяДирективаЛист3</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ФинансовоеПланирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ИА_СредстваВРезервеНаФондах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_СредстваВРезервеНаФондах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ИА_РежимРасчетаСуммы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_РежимРасчетаСуммы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РучнойВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВычисляемоеВыражение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированнаяСумма</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ИА_ФинансоваяДирективаЛист3/Ext/ObjectModule.bsl
Функция Печать(ДеревоЗП=Неопределено, ТаблицаОстатковПоФондам = Неопределено) Экспорт
	
	РазделитьНалБезнал = Константы.ИА_ФП_РазделятьНалИБезнал.Получить();
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ФинансовоеПланирование_ПФ_Лист3";
	
	Если РазделитьНалБезнал Тогда
		макет = ПолучитьМакет("ФинансоваяДирективаЛист3");
	Иначе
		макет = ПолучитьМакет("ФинансоваяДирективаЛист3Свернуто");
	КонецЕсли;
	
	ДатаНачалаОтчета =  ?(СсылкаНаОбъект.НачалоПланирования,СсылкаНаОбъект.Дата,СсылкаНаОбъект.Дата + 60*60*24);
	
	ОблШапка = Макет.ПолучитьОбласть("Заголовок");
	ОблШапка.Параметры.Номер = Число(Прав(СсылкаНаОбъект.Номер,5));
	
	ОблШапка.Параметры.ДатаНачала = Формат(ДатаНачалаОтчета, "ДФ='dd MMMM yyyy ""г.""'");    
	ОблШапка.Параметры.ДатаКонца = Формат(ДатаНачалаОтчета + 60*60*24*6 , "ДФ='dd MMMM yyyy ""г.""'");
	
	
	ТабДокумент.Вывести(ОблШапка);
	
	ОблДС = макет.ПолучитьОбласть("ДенежныеСредства");
	ОблДС.Параметры.СуммаБезНалСпецДоход = СсылкаНаОбъект.ДоходыБП.Итог("СуммаБезнал");	
	Если РазделитьНалБезнал Тогда
		ОблДС.Параметры.СуммаНалСпецДоход = СсылкаНаОбъект.ДоходыБП.Итог("СуммаНал");	
	КонецЕсли;
	
	ЗапросПоОстаткам = Новый Запрос;
	ЗапросПоОстаткам.Текст= "ВЫБРАТЬ
	|	ЕСТЬNULL(ДенежныеСредстваВРезервеОстатки.СуммаБезналОстаток, 0) КАК БезНаличные,
	|	ЕСТЬNULL(ДенежныеСредстваВРезервеОстатки.СуммаНалОстаток, 0) КАК Наличные
	|ИЗ
	|	РегистрНакопления.ИА_СредстваВРезервеНаФондах.Остатки(&ДатаНачала, Организация = &Организация) КАК ДенежныеСредстваВРезервеОстатки
	|ИТОГИ
	|	СУММА(БезНаличные),
	|	СУММА(Наличные)
	|ПО
	|	ОБЩИЕ" ;
	
	ЗапросПоОстаткам.УстановитьПараметр("ДатаНачала", СсылкаНаОбъект.Дата);	
	ЗапросПоОстаткам.УстановитьПараметр("Организация", СсылкаНаОбъект.Организация);	
	
	Выборка = ЗапросПоОстаткам.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если Выборка.Следующий() Тогда
		ОблДС.Параметры.СуммаБезНалОдобреноОстатки = Выборка.БезНаличные;	
		Если РазделитьНалБезнал Тогда
			ОблДС.Параметры.СуммаНалОдобреноОстатки = Выборка.Наличные;	
		КонецЕсли;
	Иначе
		ОблДС.Параметры.СуммаБезНалОдобреноОстатки = 0;
		Если РазделитьНалБезнал Тогда
			ОблДС.Параметры.СуммаНалОдобреноОстатки = 0;
		КонецЕсли;
	КонецЕсли;
	
	ОблДС.Параметры.СуммаБезНал = ОблДС.Параметры.СуммаБезНалСпецДоход + ОблДС.Параметры.СуммаБезНалОдобреноОстатки;
	Если РазделитьНалБезнал Тогда
		ОблДС.Параметры.СуммаНал = ОблДС.Параметры.СуммаНалСпецДоход + ОблДС.Параметры.СуммаНалОдобреноОстатки;
	КонецЕсли;
	
	ТабДокумент.Вывести(ОблДС);
	
	ОблВД = Макет.ПолучитьОбласть("ВаловойДоход");	
	ТабДокумент.Вывести(ОблВД);
	
	Для каждого стр из СсылкаНаОбъект.Доходы Цикл
		Если стр.СуммаНал =0 и стр.СуммаБезнал = 0 Тогда
			Продолжить;
		КонецЕсли;
		ОблСтрока = Макет.ПолучитьОбласть("СтрокаВидДохода");
		ОблСтрока.Параметры.Заполнить(стр);
		ТабДокумент.Вывести(ОблСтрока);
	КонецЦикла;
	
	ОблВД = Макет.ПолучитьОбласть("ВаловойДоходИтого");
	ОблВД.Параметры.СуммаБезНал = СсылкаНаОбъект.ПредварительнаяСуммаКРаспределениюБезНал1;
	Если РазделитьНалБезнал Тогда
		ОблВД.Параметры.СуммаНал = СсылкаНаОбъект.ПредварительнаяСуммаКРаспределениюНал1;
	КонецЕсли;
	
	ТабДокумент.Вывести(ОблВД);
	
	
	ОблОтчислениеСВала = Макет.ПолучитьОбласть("ОтчисленияСВалаИтог");
	ОблОтчислениеСВала.Параметры.НомерИтога = 1;
	
	ТабДокумент.Вывести(ОблОтчислениеСВала);
	
	Для каждого стр из СсылкаНаОбъект.ПолитикаРаспределенияПервичная Цикл
		Если стр.СуммаНал =0 и стр.СуммаБезнал = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОблСтрока = Макет.ПолучитьОбласть("СтрокаОтчисление");
		ОблСтрока.Параметры.Заполнить(стр);
		
		Если стр.РежимРасчета = перечисления.ИА_РежимРасчетаСуммы.Процент Тогда
			ОблСтрока.Параметры.Процент = Строка(Формат(стр.ЗначениеБезнал, "ЧЦ=15; ЧДЦ=2; ЧН=")) + "%";
		КонецЕсли;
		
		
		ТабДокумент.Вывести(ОблСтрока);
		
	КонецЦикла;
	
	ОблОтчислениеСВалаИтог = Макет.ПолучитьОбласть("ОтчисленияСВалаИтогИтог");
	
	Если РазделитьНалБезнал Тогда
		ОблОтчислениеСВалаИтог.Параметры.СуммаНал = СсылкаНаОбъект.ПолитикаРаспределенияПервичная.Итог("СуммаНал");
	КонецЕсли;
	ОблОтчислениеСВалаИтог.Параметры.СуммаБезНал = СсылкаНаОбъект.ПолитикаРаспределенияПервичная.Итог("СуммаБезНал");
	ТабДокумент.Вывести(ОблОтчислениеСВалаИтог);
	
	ОблИтог = Макет.ПолучитьОбласть("ИТОГ");
	ОблИтог.Параметры.НомерИтога = 1;
	ОблИтог.Параметры.СуммаБезНал = СсылкаНаОбъект.ПредварительнаяСуммаКРаспределениюБезНал;
	Если РазделитьНалБезнал Тогда
		ОблИтог.Параметры.СуммаНал = СсылкаНаОбъект.ПредварительнаяСуммаКРаспределениюНал;
	КонецЕсли;
	ТабДокумент.Вывести(ОблИтог);
	
	
	// Доходы БП
	ОблШапкаРаспрСД = Макет.ПолучитьОбласть("ШапкаСпецДохода");
	ОблШапкаРаспрСД.Параметры.СуммаБезНал = СсылкаНаОбъект.ДоходыБП.Итог("СуммаБезНал");
	Если РазделитьНалБезнал Тогда
		ОблШапкаРаспрСД.Параметры.СуммаНал = СсылкаНаОбъект.ДоходыБП.Итог("СуммаНал");
	КонецЕсли;
	//ОблШапкаРаспрСД.Параметры.НомерИтога = 2;
	ТабДокумент.Вывести(ОблШапкаРаспрСД);
	
	Для Каждого Стр Из СсылкаНаОбъект.ДоходыБП Цикл
		Если стр.СуммаНал =0 и стр.СуммаБезнал = 0 Тогда
			Продолжить;
		КонецЕсли;
		ОблСтрокаРаспрСД = Макет.ПолучитьОбласть("СтрокаРаспределениеСпецДохода");
		ОблСтрокаРаспрСД.Параметры.Заполнить(Стр);
		ТабДокумент.Вывести(ОблСтрокаРаспрСД);
	КонецЦикла;
	
	
	// РАспределение Доходов БП
	ОблШапкаРаспрСД = Макет.ПолучитьОбласть("ШапкаРаспределениеСпецДохода");
	ОблШапкаРаспрСД.Параметры.СуммаБезНал = СсылкаНаОбъект.ДоходыБП_Распределение.Итог("СуммаБезНал");
	Если РазделитьНалБезнал Тогда
		ОблШапкаРаспрСД.Параметры.СуммаНал = СсылкаНаОбъект.ДоходыБП_Распределение.Итог("СуммаНал");
	КонецЕсли;
	//ОблШапкаРаспрСД.Параметры.НомерИтога = 2;
	ТабДокумент.Вывести(ОблШапкаРаспрСД);
	
	Для Каждого Стр Из СсылкаНаОбъект.ДоходыБП_Распределение Цикл
		Если стр.СуммаНал =0 и стр.СуммаБезнал = 0 Тогда
			Продолжить;
		КонецЕсли;
		ОблСтрокаРаспрСД = Макет.ПолучитьОбласть("СтрокаРаспределениеСпецДохода");
		ОблСтрокаРаспрСД.Параметры.Заполнить(Стр);
		ТабДокумент.Вывести(ОблСтрокаРаспрСД);
	КонецЦикла;
	
	ОблИтог = Макет.ПолучитьОбласть("ИТОГ");
	ОблИтог.Параметры.НомерИтога = 2;
	ОблИтог.Параметры.СуммаБезНал = СсылкаНаОбъект.МаржинальнаяПрибыльБезНал;
	Если РазделитьНалБезнал Тогда
		ОблИтог.Параметры.СуммаНал = СсылкаНаОбъект.МаржинальнаяПрибыльНал;
	КонецЕсли;
	ТабДокумент.Вывести(ОблИтог);
	
	ОблОтчислениеСВала.Параметры.НомерИтога = 3;
	ТабДокумент.Вывести(ОблОтчислениеСВала);
	
	Для каждого стр из СсылкаНаОбъект.ПолитикаРаспределения Цикл
		Если стр.СуммаНал =0 и стр.СуммаБезнал = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОблСтрока = Макет.ПолучитьОбласть("СтрокаОтчисление");
		ОблСтрока.Параметры.Заполнить(стр);
		
		Если стр.РежимРасчета = перечисления.ИА_РежимРасчетаСуммы.Процент Тогда
			ОблСтрока.Параметры.Процент = Строка(Формат(стр.ЗначениеБезнал, "ЧЦ=15; ЧДЦ=2; ЧН=")) + "%";
		КонецЕсли;
		
		ТабДокумент.Вывести(ОблСтрока);
		
	КонецЦикла;
	
	
	ОблОтчислениеСВалаИтог = Макет.ПолучитьОбласть("ОтчисленияСВалаИтогИтог");
	Если РазделитьНалБезнал Тогда
		ОблОтчислениеСВалаИтог.Параметры.СуммаНал = СсылкаНаОбъект.ПолитикаРаспределения.Итог("СуммаНал");
	КонецЕсли;
	ОблОтчислениеСВалаИтог.Параметры.СуммаБезНал = СсылкаНаОбъект.ПолитикаРаспределения.Итог("СуммаБезНал");
	ТабДокумент.Вывести(ОблОтчислениеСВалаИтог);
	
	ОблОстатокКРаспределению = Макет.ПолучитьОбласть("ОстатокСредствКРаспределению");
	ОблОстатокКРаспределению.Параметры.СуммаБезНал = СсылкаНаОбъект.СуммаКРаспределениюБезнал;
	Если РазделитьНалБезнал Тогда
		ОблОстатокКРаспределению.Параметры.СуммаНал = СсылкаНаОбъект.СуммаКРаспределениюНал;
	КонецЕсли;
	ТабДокумент.Вывести(ОблОстатокКРаспределению);
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.АвтоМасштаб = Истина;
	
	
	ВыводитьГруппировкуПоСчетам = Константы.ИА_ФП_ВыводитьГруппировкуПоСчетам.Получить();
	
	Если ДеревоЗП = Неопределено Тогда
		Попытка
			ФормаДок = СсылкаНаОбъект.ПолучитьФорму();
			СтрокиЗП_1уровень = ФормаДок.ДеревоЗП.Строки;
		Исключение
			СтрокиЗП_1уровень = Неопределено;
		КонецПопытки;
	Иначе
		СтрокиЗП_1уровень = ДеревоЗП.Строки;
	КонецЕсли;
	
	ОблШапка = Макет.ПолучитьОбласть("ШапкаСтатьиРасходов");
	Если ВыводитьГруппировкуПоСчетам Тогда
		ЗаголовокШапкаСтатьиРасходов = "Счет / Подразделение / Заказ";
	Иначе
		ЗаголовокШапкаСтатьиРасходов = "Подразделение / Заказ";
	КонецЕсли;
	ОблШапка.Параметры.СчетПодразделение = ЗаголовокШапкаСтатьиРасходов;
	ТабДокумент.Вывести(ОблШапка);
	
	
	ИтогоИсх=0;
	ИтогоОдобрено = 0;
	
	//ТаблицаОстатковПоФондам

	Если ВыводитьГруппировкуПоСчетам Тогда
		Для Каждого СтрокаЗП_1уровень Из СтрокиЗП_1уровень Цикл
			
			Если ВыводитьГруппировкуПоСчетам Тогда
				

				ОблСчет = Макет.ПолучитьОбласть("СтрокаСчет");
				ОблСчет.Параметры.Заполнить(СтрокаЗП_1уровень);
				ОблСчет.Параметры.Счет = СтрокаЗП_1уровень.Счет;
				ОблСчет.Параметры.ИсходнаяСумма = СтрокаЗП_1уровень.СуммаНал+СтрокаЗП_1уровень.СуммаБезНал;
				ТабДокумент.Вывести(ОблСчет);
				
				ОстатокПоСчету = ПолучитьИтогПоТаблицаОстатков(ТаблицаОстатковПоФондам, Новый Структура("Счет, Подразделение, Фонд", СтрокаЗП_1уровень.Счет, null, null), "ПослеФП_Остаток", "ПослеФП_Резерв");
				ОблСчетИтого = Макет.ПолучитьОбласть("СтрокаСчетИтого");
				ОблСчетИтого.Параметры.Заполнить(СтрокаЗП_1уровень);
				ОблСчетИтого.Параметры.Остаток = ОстатокПоСчету;
				ОблСчетИтого.Параметры.Разница = ОстатокПоСчету - СтрокаЗП_1уровень.ИсходнаяСумма;
				
			КонецЕсли;
			
			ВывестиПодразделения(Макет, СтрокаЗП_1уровень.Строки, ТабДокумент, ИтогоИсх, ИтогоОдобрено, ВыводитьГруппировкуПоСчетам, ТаблицаОстатковПоФондам);
			
			ТабДокумент.Вывести(ОблСчетИтого);
			
		КонецЦикла;
	Иначе
		ВывестиПодразделения(Макет, СтрокиЗП_1уровень, ТабДокумент, ИтогоИсх, ИтогоОдобрено, ВыводитьГруппировкуПоСчетам, ТаблицаОстатковПоФондам);
	КонецЕсли;
	
	ОблОтделение = Макет.ПолучитьОбласть("СтрокаОтделениеИтого");
	ОблОтделение.Параметры.ИсходнаяСумма = ИтогоИсх;
	ОблОтделение.Параметры.УтвержденнаяСумма = ИтогоОдобрено;
	ТабДокумент.Вывести(ОблОтделение);
	
	//ИА_Арчил Тваладзе 2016.06.01
	ОблШапкаЗНО = Макет.ПолучитьОбласть("ШапкаЗНО");
	ТабДокумент.Вывести(ОблШапкаЗНО);
	
	ОблСтрокаЗНО = Макет.ПолучитьОбласть("СтрокаЗНО");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ФинансовоеПланированиеЗНО.Заказ КАК Заявка,
	               |	ИА_ФинансовоеПланированиеЗНО.Заказ.Подразделение КАК Подразделение,
	               |	ИА_ФинансовоеПланированиеЗНО.Заказ.Фонд КАК Фонд,
	               |	ИА_ФинансовоеПланированиеЗНО.Заказ.ПредметЗаказа КАК ПредметЗаказа,
	               |	ИА_ФинансовоеПланированиеЗНО.Заказ.Сумма КАК Сумма,
	               |	ИА_ФинансовоеПланированиеЗНО.Статус
	               |ИЗ
	               |	Документ.ИА_ФинансовоеПланирование.ЗНО КАК ИА_ФинансовоеПланированиеЗНО
	               |ГДЕ
	               |	ИА_ФинансовоеПланированиеЗНО.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",СсылкаНаОбъект);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОблСтрокаЗНО.Параметры, ВыборкаДетальныеЗаписи);
		ОблСтрокаЗНО.Параметры.Заявка = "ЗНО №"+ Формат(Число(Прав(ВыборкаДетальныеЗаписи.Заявка.Номер,5)),"ЧГ=") + " " + Формат(ВыборкаДетальныеЗаписи.Заявка.Дата,"ДФ=dd.MM.yyyy");
		
		ТабДокумент.Вывести(ОблСтрокаЗНО);
	КонецЦикла;
	//Конец Арчил Тваладзе
	
	Если СсылкаНаОбъект.РаспределениеПоФондам.Количество()> 0 Тогда
		ОблПеремещениеШапка  = Макет.ПолучитьОбласть("ПеремещениеМеждуФондамиШапка");
		ОблПеремещениеСтрока = Макет.ПолучитьОбласть("ПеремещениеМеждуФондамиСтрока");
		ТабДокумент.Вывести(ОблПеремещениеШапка);
		
		Для каждого ТекущаяСтрока из СсылкаНаОбъект.РаспределениеПоФондам Цикл
			Если ТекущаяСтрока.СуммаНал =0 и ТекущаяСтрока.СуммаБезнал = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ОблПеремещениеСтрока.Параметры.НаФондПодразделение = СокрЛП(ТекущаяСтрока.Фонд) +" / "+ СокрЛП(ТекущаяСтрока.Подразделение);
			ОблПеремещениеСтрока.Параметры.СФондаПодразделения = СокрЛП(ТекущаяСтрока.СФонда) +" / "+ СокрЛП(ТекущаяСтрока.СПодразделения);
			ОблПеремещениеСтрока.Параметры.Займ                = СокрЛП(ТекущаяСтрока.ЗаймВозврат);
			ОблПеремещениеСтрока.Параметры.Причина             = СокрЛП(ТекущаяСтрока.ПричинаЗайма);
			
			ОблПеремещениеСтрока.Параметры.СуммаБезНал         = Формат(ТекущаяСтрока.СуммаБезНал,"ЧЦ=15; ЧДЦ=2; ЧН=");
			Если РазделитьНалБезнал Тогда
				ОблПеремещениеСтрока.Параметры.СуммаНал            = Формат(ТекущаяСтрока.СуммаНал,"ЧЦ=15; ЧДЦ=2; ЧН=");
			КонецЕсли;
			
			ТабДокумент.Вывести(ОблПеремещениеСтрока);
			
		КонецЦикла;
	КонецЕсли;	
	ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	ТабДокумент.Вывести(ОблПодвал);
	
	Возврат ТабДокумент;	
КонецФункции

Процедура ВывестиПодразделения(Макет, Подразделения, ТабДокумент, ИтогоИсх, ИтогоОдобрено, ВыводитьГруппировкуПоСчетам, ТаблицаОстатковПоФондам)
	
	Для Каждого Подразделение Из Подразделения Цикл
		
		Если (Подразделение.УтвержденнаяСумма = 0 ИЛИ Подразделение.УтвержденнаяСумма = Неопределено) И (Подразделение.СуммаНал = 0 И Подразделение.СуммаБезНал = Неопределено) Тогда
			Продолжить;
		КонецЕсли;
		ИтогоИсх = ИтогоИсх + Подразделение.СуммаНал + Подразделение.СуммаБезНал;
		ИтогоОдобрено = ИтогоОдобрено + ?(Подразделение.УтвержденнаяСумма = Неопределено, 0 , Подразделение.УтвержденнаяСумма);
		
		ОблОтделение = Макет.ПолучитьОбласть("СтрокаПодразделение");
		ОблОтделение.Параметры.Заполнить(Подразделение);
		ОблОтделение.Параметры.ИсходнаяСумма = Подразделение.СуммаНал+Подразделение.СуммаБезНал;
		
		Если Подразделение.УтвержденнаяСумма = Неопределено Тогда
			ОблОтделение.Параметры.УтвержденнаяСумма = 0;
		КонецЕсли;
		
		ТабДокумент.Вывести(ОблОтделение);
		
		ОблОтделениеИтого = Макет.ПолучитьОбласть("СтрокаПодразделениеИтого");
		ОблОтделениеИтого.Параметры.Заполнить(Подразделение);
		Если ВыводитьГруппировкуПоСчетам Тогда
			
			ОтборСтрок =  Новый Структура("Счет, Подразделение, Фонд", Подразделение.Счет, Подразделение.Подразделение, null);
		Иначе
			
			ОтборСтрок =  Новый Структура("Подразделение, Фонд", Подразделение.Подразделение, null);
		КонецЕсли;
		ОстатокПоПодразделению = ПолучитьИтогПоТаблицаОстатков(ТаблицаОстатковПоФондам, ОтборСтрок, "ПослеФП_Остаток", "ПослеФП_Резерв");
		
		ОблОтделениеИтого.Параметры.Остаток = ОстатокПоПодразделению;
		ОблОтделениеИтого.Параметры.Разница = ОстатокПоПодразделению - Подразделение.ИсходнаяСумма;

		ВывестиФонды(Макет, Подразделение.Строки, ТабДокумент, ВыводитьГруппировкуПоСчетам);
		

		ТабДокумент.Вывести(ОблОтделениеИтого);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиФонды(Макет, Фонды, ТабДокумент, ВыводитьГруппировкуПоСчетам)
	
	ТЗСтатей = Новый ТаблицаЗначений;
	ТЗСтатей.Колонки.Добавить("Счет");
	ТЗСтатей.Колонки.Добавить("Статья");
	ТЗСтатей.Колонки.Добавить("Фонд");
	ТЗСтатей.Колонки.Добавить("Заказ");
	ТЗСтатей.Колонки.Добавить("ИсходнаяСумма");
	ТЗСтатей.Колонки.Добавить("УтвержденнаяСумма");
	ТЗСтатей.Колонки.Добавить("ПричинаОтказа");
	
	Для Каждого Фонд Из Фонды Цикл
		
		Заявки = Фонд.Строки;
		
		Для Каждого Заявка Из Заявки Цикл
			НоваяСтрока =  ТЗСтатей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Заявка);
			НоваяСтрока.ИсходнаяСумма = Заявка.СуммаНал + Заявка.СуммаБезНал;
		КонецЦикла;
		
	КонецЦикла;
	
	ТЗЗаказов = ТЗСтатей.Скопировать();
	
	Если ВыводитьГруппировкуПоСчетам Тогда
		ТЗСтатей.Свернуть("Счет, Статья, Фонд", "ИсходнаяСумма, УтвержденнаяСумма");
		ТЗЗаказов.Свернуть("Счет, Статья, Фонд, Заказ, ПричинаОтказа", "ИсходнаяСумма, УтвержденнаяСумма");
	иначе
		ТЗСтатей.Свернуть("Статья, Фонд", "ИсходнаяСумма, УтвержденнаяСумма");
		ТЗЗаказов.Свернуть("Статья, Фонд, Заказ, ПричинаОтказа", "ИсходнаяСумма, УтвержденнаяСумма");
	КонецЕсли;
	
	Для Каждого Статья Из ТЗСтатей Цикл
		Если Статья.УтвержденнаяСумма =0 И Статья.ИсходнаяСумма =0 Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Статья",Статья.Статья);
		Отбор.Вставить("Фонд",Статья.Фонд);
		Если ВыводитьГруппировкуПоСчетам Тогда
			Отбор.Вставить("Счет",Статья.Счет);
		КонецЕсли;
		
		СтрокиЗаказов =  ТЗЗаказов.НайтиСтроки(Отбор);
		Если СтрокиЗаказов.Количество() > 0 Тогда
			
			Для Каждого Заказ Из СтрокиЗаказов Цикл
				//Если Заказ.УтвержденнаяСумма = 0 Тогда
				//	Продолжить;
				//КонецЕсли;
				ОблЗаказ = Макет.ПолучитьОбласть("СтрокаЗаявка");
				ОблЗаказ.Параметры.Заполнить(Заказ);
				ОблЗаказ.Параметры.Заказ = "Заказ на приобретение №"+ Формат(Число(Прав(Заказ.Заказ.Номер,5)),"ЧГ=") + " " + Формат(Заказ.Заказ.Дата,"ДФ=dd.MM.yyyy");
				ОблЗаказ.Параметры.ПредметЗаказа = Заказ.Заказ.ПредметЗаказа;
				ОблЗаказ.Параметры.ПричинаОтказа = Заказ.ПричинаОтказа;
				ТабДокумент.Вывести(ОблЗаказ);
			КонецЦикла;
			
		КонецЕсли;
		
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьИтогПоТаблицаОстатков(ТаблицаОстатковПоФондам, ОтборСтрок, ИмяКолонкиОстатки, ИмяКолонкиРезерв)
	
	
	СтрокиОтбора = ТаблицаОстатковПоФондам.НайтиСтроки(ОтборСтрок);
	ЗначениеИтога = 0;
	
	Для каждого СтрокаОтбора Из СтрокиОтбора  Цикл
		 ЗначениеИтога = ЗначениеИтога + СтрокаОтбора[ИмяКолонкиОстатки] + СтрокаОтбора[ИмяКолонкиРезерв];
	КонецЦикла;
	
	Возврат ЗначениеИтога;
	
КонецФункции
